Enums/НазначениеПравИНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НазначениеПравИНастроек</Name>
			<Comment>Определяют уровень применимости права / настройки</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Компания</Name>
					<Comment>Значение права определяется для компании в целом (всей информационной базы)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
					<Comment>Значение права определяется для каждой организации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>Значение права определяется для каждого подразделения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Значение права определяется для каждого пользователя</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыПравДляСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПравДляСправочников</Name>
			<Comment>Перечисление видов прав для справочников</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Редактирование</Name>
					<Comment>Возможность редактирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РедактированиеПоГруппам</Name>
					<Comment>Возможность редактирования по группам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чтение</Name>
					<Comment>Возможность чтения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НетДоступа</Name>
					<Comment>Нет доступа</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВариантыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ВариантыОтчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеПравИНастроек</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Comment>Объект по которому производится отображение настраиваемых вариантов отчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПредопределенный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяНастройка</Name>
					<Comment>Пользовательская настройка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантЗагрузкиПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SettingsStorages/ХранилищеВариантовОтчетов/Forms/СохранениеВариантаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьОграничениеТипа()
	
	Если ПользовательскаяНастройка = 1 Тогда
		Элементы.НазначениеДоступа.Доступность       = Ложь;
		Элементы.ОбъектДоступа.Доступность           = Ложь;
		Элементы.ОбъектДоступа.ОтметкаНезаполненного = Ложь;
	Иначе
		Элементы.НазначениеДоступа.Доступность       = Истина;
		Элементы.ОбъектДоступа.Доступность           = Истина;
		Элементы.ОбъектДоступа.ОтметкаНезаполненного = Истина;
		Если НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Организация") Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Организации");
			Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Подразделение") Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
			Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Пользователь") Тогда
			ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
			Элементы.ОбъектДоступа.ОграничениеТипа = ДопустимыеТипы;
		Иначе
			Элементы.ОбъектДоступа.Доступность           = Ложь;
			Элементы.ОбъектДоступа.ОтметкаНезаполненного = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если обПраво("ПроверкаДоступаКСправочникамИДокументам") Тогда
		СправочникИмя = Метаданные.Справочники.ВариантыОтчетов.Имя;
		ПравоДоступа = обПраво("Право доступа "+СправочникИмя);
		Если ПравоДоступа=Перечисления.ВидыПравДляСправочников.НетДоступа Тогда
			Отказ=Истина;
			Возврат;
		ИначеЕсли ПравоДоступа=Перечисления.ВидыПравДляСправочников.Чтение Тогда
			ТолькоПросмотр = Истина;
			Элементы.Наименование.ТолькоПросмотр              = Истина;
			Элементы.Описание.ТолькоПросмотр                  = Истина;
			Элементы.ВариантЗагрузкиПериода.ТолькоПросмотр    = Истина;
			Элементы.ПользовательскаяНастройка.ТолькоПросмотр = Истина;
			Элементы.ГруппаДоступности.ТолькоПросмотр         = Истина;
			Элементы.Сохранить.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	КлючОтчета   = Параметры.КлючОбъекта;
	КлючВарианта = Параметры.КлючТекущихНастроек;
	
	МетаданныеОтчета = Метаданные.НайтиПоПолномуИмени(Параметры.КлючОбъекта);
	Если МетаданныеОтчета = Неопределено Тогда
		ПозицияТочки = Найти(Параметры.КлючОбъекта, ".");
		Если ПозицияТочки>0 Тогда
			ИмяОтчета = Сред(Параметры.КлючОбъекта, ПозицияТочки+1);
		Иначе
			ИмяОтчета = Параметры.КлючОбъекта;
		КонецЕсли;
	Иначе
		ИмяОтчета = МетаданныеОтчета.Имя;
	КонецЕсли;
	
	ТекущийПользователь  = ПараметрыСеанса.Пользователь;
	ТекущаяОрганизация   = ПараметрыСеанса.Организация;
	ТекущееПодразделение = ПараметрыСеанса.ПодразделениеКомпании;
	
	Если обПраво("РазрешитьРедактироватьОбщиеВариантыОтчетов") Тогда
		ЭтаФорма.Элементы.ГруппаДоступности.Доступность         = Истина;
		ЭтаФорма.Элементы.ПользовательскаяНастройка.Доступность = Истина;
		ПолныеПраваНаВарианты = Истина;
	Иначе
		ЭтаФорма.Элементы.ГруппаДоступности.Доступность         = Ложь;
		ЭтаФорма.Элементы.ПользовательскаяНастройка.Доступность = Ложь;
		ПолныеПраваНаВарианты = Ложь;
	КонецЕсли;
	
	СписокВыбора = Элементы.ВариантЗагрузкиПериода.СписокВыбора;
	Для Каждого ТекЭлемент Из ВариантСтандартногоПериода Цикл
		
		ИмяЭлемента = ПолучитьПолноеИмяПредопределенногоЗначения(ТекЭлемент);
		Если ИмяЭлемента = "ВариантСтандартногоПериода.ПроизвольныйПериод" Тогда
			Продолжить;
		КонецЕсли;
		
		СписокВыбора.Добавить(ПолучитьПолноеИмяПредопределенногоЗначения(ТекЭлемент), Строка(ТекЭлемент));
		
	КонецЦикла;
	
	ЗаполнитьСписокВариантов();
	
	ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Поле ""Наименование"" не заполнено'"),
			,
			"Наименование"
		);
		Отказ = Истина;
	ИначеЕсли ХранилищаНастроек.ХранилищеВариантовОтчетов.НаименованиеЗанято(КлючОтчета, ВариантОтчета, Наименование) Тогда
		ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = '"""+СокрЛП(Наименование)+""" занято, необходимо указать другое Наименование.'"),, "Наименование");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = ИмяФормы Тогда
		Возврат;
	КонецЕсли;
	
	//Если ИмяСобытия = ВариантыОтчетовКлиентСервер.ИмяСобытияИзменениеВарианта()
	//	И ТипЗнч(Параметр) = Тип("Структура")
	//	И Параметр.Свойство("Ссылка") Тогда
	//	
	//	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Ссылка", Параметр.Ссылка));
	//	Если Найденные.Количество() = 1 Тогда
	//		Вариант = Найденные[0];
	//		ЗаполнитьЗначенияСвойств(Вариант, Параметр);
	//		Вариант.АвторТекущийПользователь = (Вариант.Автор = ТекущийПользователь);
	//		ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийЭлемент = Элементы.Наименование;
	УстановитьОграничениеТипа();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", Наименование));
	Если Найденные.Количество() > 0 Тогда
		Элементы.ВариантыОтчета.ТекущаяСтрока = Найденные[0].ПолучитьИдентификатор();
		ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма);
	Иначе
		ВариантОтчета             = ПредопределенноеЗначение("Справочник.ВариантыОтчетов.ПустаяСсылка");
		ПользовательскаяНастройка = 1;
		ПользовательскаяНастройкаПриИзменении(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
	
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", Текст));
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ВариантыОтчета

&НаКлиенте
Процедура ВариантыОтчетаПриАктивизацииСтроки(Элемент)
	
	Если ИдентификаторТекущейСтроки = Элементы.ВариантыОтчета.ТекущаяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма);
	УстановитьОграничениеТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СохранитьИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ОткрытьВариантДляИзменения();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	Вариант = Элементы.ВариантыОтчета.ТекущиеДанные;
	Если Вариант = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Вариант.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПолныеПраваНаВарианты И НЕ Вариант.АвторТекущийПользователь Тогда
		Предупреждение(НСтр("ru = 'Недостаточно прав доступа для удаления варианта отчета """+Вариант.Наименование+""".'"),);
		Возврат;
	КонецЕсли;
	
	Если Вариант.Предопределенный Тогда
		Предупреждение(НСтр("ru = 'Невозможно удалить предопределенный вариант отчета.'"));
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = ?(Вариант.ПометкаУдаления, НСтр("ru = 'Снять с """+Вариант.Наименование+""" пометку на удаление?'"), НСтр("ru = 'Пометить """+Вариант.Наименование+""" на удаление?'"));
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КодВозвратаДиалога.Да); 
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьВариантНаСервере(Вариант.Ссылка, Вариант.ИндексКартинки, Вариант.ПометкаУдаления);
	
	ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОтчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура Сохранить(Команда)
	
	СохранитьИЗакрыть();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// Клиент

&НаКлиенте
Функция ПерейтиНаСтраницу2Клиент()
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		//	НСтр("ru = 'Поле ""Наименование"" не заполнено'"),
		//	,
		//	"ВариантНаименование"
		//);
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВариантОтчета) Тогда
		Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Ссылка", ВариантОтчета));
		Вариант = Найденные[0];
		Если НЕ ПравоЗаписиВарианта(Вариант, ПравоНастройкиВарианта(Вариант, ПолныеПраваНаВарианты)) Тогда
			//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			//	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			//		НСтр("ru = 'Недостаточно прав на изменение варианта ""%1"", необходимо выбрать другой вариант или изменить Наименование.'"),
			//		ВариантНаименование
			//	),
			//	,
			//	"ВариантНаименование"
			//);
			Возврат Ложь;
		КонецЕсли;
		
		Если Вариант.ПометкаУдаления = Истина Тогда
			ТекстВопроса = НСтр("ru = 'Вариант отчета """+Наименование+""" помечен на удаление.
			|Заменить помеченный на удаление вариант отчета?'");
			КнопкаПоУмолчанию = КодВозвратаДиалога.Нет;
		Иначе
			ТекстВопроса = НСтр("ru = 'Заменить ранее сохраненный вариант отчета """+Наименование+"""?'");
			КнопкаПоУмолчанию = КодВозвратаДиалога.Да;
		КонецЕсли;
		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60, КнопкаПоУмолчанию); 
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница2;
	Элементы.Назад.Доступность        = Истина;
	Элементы.Далее.Доступность        = Ложь;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ОткрытьВариантДляИзменения()
	
	Вариант = Элементы.ВариантыОтчета.ТекущиеДанные;
	Если Вариант = Неопределено ИЛИ НЕ ЗначениеЗаполнено(Вариант.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПравоНастройкиВарианта(Вариант, ПолныеПраваНаВарианты) Тогда
		Предупреждение(НСтр("ru = 'Недостаточно прав доступа для изменения варианта """+Наименование+""".'"));
		Возврат;
	КонецЕсли;
	
	ОткрытьЗначение(Вариант.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть()
	
	Если ПроверитьИЗаписатьНаСервере() И ЗначениеЗаполнено(КлючВарианта) Тогда
		
		//ВариантыОтчетовКлиент.ОбновитьОткрытыеПанелиОтчетов(, ИмяФормы);
		ПараметрОповещения = Новый Структура("КлючОтчета, ИмяОтчета, КлючВарианта", КлючОтчета, ИмяОтчета, КлючВарианта);
		Оповестить("ВариантыОтчетов.ИзменениеВарианта", ПараметрОповещения, ИмяФормы);
		
		Закрыть(Новый ВыборНастроек(КлючВарианта));
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// Клиент и сервер

&НаКлиентеНаСервереБезКонтекста
Процедура ВариантыОтчетаОбработчикАктивизацииСтроки(ЭтаФорма)
	
	ЭтаФорма.ИдентификаторТекущейСтроки = ЭтаФорма.Элементы.ВариантыОтчета.ТекущаяСтрока;
	
	Вариант = ЭтаФорма.ВариантыОтчета.НайтиПоИдентификатору(ЭтаФорма.ИдентификаторТекущейСтроки);
	Если Вариант = Неопределено Тогда
		#Если Сервер Тогда
			ЭтаФорма.ВариантЗагрузкиПериода = ХранилищаНастроек.ХранилищеВариантовОтчетов.ПолучитьВариантПериода(ЭтаФорма.КлючОтчета, ЭтаФорма.КлючВарианта);
		#КонецЕсли
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.НазначениеДоступа         = Вариант.НазначениеДоступа;
	ЭтаФорма.Наименование              = Вариант.Наименование;
	ЭтаФорма.ОбъектДоступа             = Вариант.ОбъектДоступа;
	ЭтаФорма.ВариантОтчета             = Вариант.Ссылка;
	ЭтаФорма.ПользовательскаяНастройка = ?(Вариант.ПользовательскаяНастройка, 1, 2);
	ЭтаФорма.Описание                  = Вариант.Описание;
	ЭтаФорма.ОбъектДоступа             = Вариант.ОбъектДоступа;
	ЭтаФорма.ПредставлениеОтчета       = Вариант.ПредставлениеОтчета;
	ЭтаФорма.ВариантЗагрузкиПериода    = Вариант.ВариантЗагрузкиПериода;
	
	Если Вариант.Предопределенный Тогда
		ЭтаФорма.Элементы.ГруппаДоступности.Доступность         = Ложь;
		ЭтаФорма.Элементы.ПользовательскаяНастройка.Доступность = Ложь;
	Иначе
		ЭтаФорма.Элементы.ГруппаДоступности.Доступность         = Истина;
		ЭтаФорма.Элементы.ПользовательскаяНастройка.Доступность = Истина;
	КонецЕсли;
	
	Если ЭтаФорма.ВариантЗагрузкиПериода = "" Тогда
		ЭтаФорма.ВариантЗагрузкиПериода = "ВариантСтандартногоПериода.ЭтотМесяц";
	КонецЕсли;
	
	Если НЕ ЭтаФорма.ПолныеПраваНаВарианты Тогда
		
		ЭтаФорма.Элементы.ГруппаДоступности.Доступность         = Ложь;
		ЭтаФорма.Элементы.ПользовательскаяНастройка.Доступность = Ложь;
		
		Если Вариант.ПользовательскаяНастройка Тогда
			ЭтаФорма.Элементы.Сохранить.Доступность = Истина;
		Иначе
			ЭтаФорма.Элементы.Сохранить.Доступность = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПравоНастройкиВарианта(Вариант, ПолныеПраваНаВарианты)
	
	//Возврат (ПолныеПраваНаВарианты ИЛИ Вариант.Автор) И ЗначениеЗаполнено(Вариант.Ссылка);
	Возврат Истина;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПравоЗаписиВарианта(Вариант, ПравоНастройкиВарианта)
	
	Возврат (Вариант.ПользовательскаяНастройка = 1) И ПравоНастройкиВарианта;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СформироватьСвободноеНаименование(Вариант, ВариантыОтчета)
	//ШаблонИмениВарианта = СокрЛП(Вариант.Наименование) +" - "+ НСтр("ru = 'копия'");
	//
	//СвободноеНаименование = ШаблонИмениВарианта;
	//Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", СвободноеНаименование));
	//Если Найденные.Количество() = 0 Тогда
	//	Возврат СвободноеНаименование;
	//КонецЕсли;
	//
	//НомерВарианта = 1;
	//Пока Истина Цикл
	//	НомерВарианта = НомерВарианта + 1;
	//	СвободноеНаименование = ШаблонИмениВарианта +" (" + Формат(НомерВарианта, "") + ")";
	//	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("Наименование", СвободноеНаименование));
	//	Если Найденные.Количество() = 0 Тогда
	//		Возврат СвободноеНаименование;
	//	КонецЕсли;
	//КонецЦикла;
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Вызов сервера

&НаСервереБезКонтекста
Процедура УдалитьВариантНаСервере(Ссылка, ИндексКартинки, ПометкаУдаления)
	
	ВариантОбъект = Ссылка.ПолучитьОбъект();
	ВариантОбъект.УстановитьПометкуУдаления(НЕ ВариантОбъект.ПометкаУдаления);
	ПометкаУдаления = ВариантОбъект.ПометкаУдаления;
	ИндексКартинки = ?(ПометкаУдаления, 4, 3);
	
КонецПроцедуры

&НаСервере
Функция ПерезаполнитьДерево()
	
	//Если ЗначениеЗаполнено(ВариантСсылка) Тогда
	//	ВариантОснование = ВариантСсылка;
	//Иначе
	//	ВариантОснование = ПрототипСсылка;
	//КонецЕсли;
	
	//ДеревоПриемник = ВариантыОтчетов.ДеревоПодсистемСформировать(ЭтаФорма, ВариантОснование);
	
	//Найденные = ДеревоПриемник.Строки.НайтиСтроки(Новый Структура("Использование", 1), Истина);
	//Для Каждого Приемник Из Найденные Цикл
	//	Приемник.ИспользованиеПоУмолчанию = 0;
	//	Приемник.ВажностьПоУмолчанию      = "";
	//	Приемник.ИзмененПользователем     = Истина;
	//КонецЦикла;
	//
	//ЗначениеВРеквизитФормы(ДеревоПриемник, "ДеревоПодсистем");
	//
	Возврат Истина;
КонецФункции

&НаСервере
Функция ПроверитьИЗаписатьНаСервере()
	
	Если обПраво("ПроверкаДоступаКСправочникамИДокументам") Тогда
		СправочникИмя = Метаданные.Справочники.ВариантыОтчетов.Имя;
		ПравоДоступа = обПраво("Право доступа "+СправочникИмя);
		Если ПравоДоступа=Перечисления.ВидыПравДляСправочников.НетДоступа Тогда
			ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Доступ запрещен.'"));
			Возврат Ложь;
		ИначеЕсли ПравоДоступа=Перечисления.ВидыПравДляСправочников.Чтение Тогда
			ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Запрещено редактирование.'"));
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не заполнено Наименование.'"));
		Возврат Ложь;
	КонецЕсли;
	
	ВариантЭтоНовый = НЕ ЗначениеЗаполнено(ВариантОтчета);
	
	Если ВариантЭтоНовый И ХранилищаНастроек.ХранилищеВариантовОтчетов.НаименованиеЗанято(КлючОтчета, ВариантОтчета, Наименование) Тогда
		ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '"""+СокрЛП(Наименование)+""" занято, необходимо указать другое Наименование.'"),, "Наименование");
		Возврат Ложь;
	ИначеЕсли ВариантОтчета.ЭтоПредопределенный Тогда
		ПроцедурыОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = '"""+СокрЛП(Наименование)+""" занято, необходимо указать другое Наименование.'"),, "Наименование");
		Возврат Ложь;
	КонецЕсли;
	
	Если ВариантЭтоНовый Тогда
		ВариантОбъект = Справочники.ВариантыОтчетов.СоздатьЭлемент();
		ВариантОбъект.КлючОтчета            = КлючОтчета;
		ВариантОбъект.ИмяОтчета             = ИмяОтчета;
		ВариантОбъект.КлючВарианта          = Строка(Новый УникальныйИдентификатор());
	Иначе
		ВариантОбъект = ВариантОтчета.ПолучитьОбъект();
	КонецЕсли;
	
	ВариантОбъект.Автор                     = ТекущийПользователь;
	ВариантОбъект.Наименование              = Наименование;
	ВариантОбъект.Описание                  = Описание;
	ВариантОбъект.НазначениеДоступа         = НазначениеДоступа;
	ВариантОбъект.ПользовательскаяНастройка = ?(ПользовательскаяНастройка = 1, Истина, Ложь);
	ВариантОбъект.ПредставлениеОтчета       = ПредставлениеОтчета;
	ВариантОбъект.ВариантЗагрузкиПериода    = ВариантЗагрузкиПериода;
	
	Если ПользовательскаяНастройка = 1 Тогда
		ВариантОбъект.ОбъектДоступа = Неопределено;
	ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Организация") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Организации");
		ВариантОбъект.ОбъектДоступа = ДопустимыеТипы.ПривестиЗначение(ОбъектДоступа);
	ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Подразделение") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании");
		ВариантОбъект.ОбъектДоступа = ДопустимыеТипы.ПривестиЗначение(ОбъектДоступа);
	ИначеЕсли НазначениеДоступа = ПредопределенноеЗначение("Перечисление.НазначениеПравИНастроек.Пользователь") Тогда
		ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		ВариантОбъект.ОбъектДоступа = ДопустимыеТипы.ПривестиЗначение(ОбъектДоступа);
	Иначе
		ВариантОбъект.ОбъектДоступа = Неопределено;
	КонецЕсли;
	
	ВариантОбъект.Записать();
	
	ВариантОтчета = ВариантОбъект.Ссылка;
	КлючВарианта  = ВариантОбъект.КлючВарианта;
	
	Возврат Истина;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// Сервер

&НаКлиенте
Процедура ОписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	МногострочныйТекст   = Описание;
	
	ТекстВведен = ВвестиСтроку(МногострочныйТекст, НСтр("ru = 'Описание'"),, Истина);
	
	Если ТекстВведен Тогда
		Описание = МногострочныйТекст;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВариантов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВариантыОтчетов.Ссылка,
	|	ВариантыОтчетов.ВерсияДанных,
	|	ВариантыОтчетов.ПометкаУдаления,
	|	ВариантыОтчетов.ЭтоПредопределенный КАК Предопределенный,
	|	ВариантыОтчетов.Наименование,
	|	ВариантыОтчетов.ПредставлениеОтчета КАК ПредставлениеОтчета,
	|	ВариантыОтчетов.КлючОтчета КАК КлючОтчета,
	|	ВариантыОтчетов.ИмяОтчета КАК ИмяОтчета,
	|	ВариантыОтчетов.КлючВарианта КАК КлючВарианта,
	|	ВариантыОтчетов.Автор КАК Автор,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.Автор = &Пользователь
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АвторТекущийПользователь,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.ПометкаУдаления
	|			ТОГДА 4
	|		КОГДА ВариантыОтчетов.ЭтоПредопределенный
	|			ТОГДА 5
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК ИндексКартинки,
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.ПометкаУдаления
	|			ТОГДА 3
	|		КОГДА ВариантыОтчетов.ЭтоПредопределенный
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок,
	|	ВариантыОтчетов.Настройки КАК Настройки,
	|	ВариантыОтчетов.Описание КАК Описание,
	|	ВариантыОтчетов.НазначениеДоступа КАК НазначениеДоступа,
	|	ВариантыОтчетов.ОбъектДоступа КАК ОбъектДоступа,
	|	ВариантыОтчетов.ВариантЗагрузкиПериода КАК ВариантЗагрузкиПериода,
	|	ВариантыОтчетов.ПользовательскаяНастройка КАК ПользовательскаяНастройка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.ЭтоПредопределенный = ЛОЖЬ И 
	|	ВариантыОтчетов.КлючОтчета = &КлючОтчета И 
	|	(ВариантыОтчетов.Автор = &Пользователь ИЛИ 
	|	(ВариантыОтчетов.ПользовательскаяНастройка = ЛОЖЬ И 
	|	(ВариантыОтчетов.НазначениеДоступа = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Пользователь) И ВариантыОтчетов.ОбъектДоступа = &Пользователь) ИЛИ 
	|	(ВариантыОтчетов.НазначениеДоступа = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Подразделение) И ВариантыОтчетов.ОбъектДоступа = &Подразделение) ИЛИ 
	|	(ВариантыОтчетов.НазначениеДоступа = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Организация) И ВариантыОтчетов.ОбъектДоступа = &Организация) ИЛИ 
	|	(ВариантыОтчетов.НазначениеДоступа = ЗНАЧЕНИЕ(Перечисление.НазначениеПравИНастроек.Компания) И ВариантыОтчетов.ОбъектДоступа = НЕОПРЕДЕЛЕНО)))
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ВариантыОтчетов.ПометкаУдаления
	|			ТОГДА 3
	|		КОГДА ВариантыОтчетов.ЭтоПредопределенный
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ,
	|	ВариантыОтчетов.Наименование";
	
	ВариантыОтчета.Очистить();
	
	Запрос.УстановитьПараметр("КлючОтчета",    КлючОтчета);
	Запрос.УстановитьПараметр("Пользователь",  ТекущийПользователь);
	Запрос.УстановитьПараметр("Подразделение", ТекущееПодразделение);
	Запрос.УстановитьПараметр("Организация",   ТекущаяОрганизация);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ВариантыОтчета.Загрузить(ТаблицаЗначений);
	
	//ВариантыОтчета.Сортировать("Порядок, Наименование Возр");
	
	ИдентификаторТекущейСтроки = -1;
	Найденные = ВариантыОтчета.НайтиСтроки(Новый Структура("КлючВарианта", КлючВарианта));
	Если Найденные.Количество() > 0 Тогда
		Вариант = Найденные[0];
		ВариантОтчета             = Вариант.Ссылка;
		Описание                  = Вариант.Описание;
		НазначениеДоступа         = Вариант.НазначениеДоступа;
		Наименование              = Вариант.Наименование;
		ОбъектДоступа             = Вариант.ОбъектДоступа;
		ПользовательскаяНастройка = ?(Вариант.ПользовательскаяНастройка=1, Истина, Ложь);
		ПредставлениеОтчета       = Вариант.ПредставлениеОтчета;
		
		ИдентификаторТекущейСтроки            = Вариант.ПолучитьИдентификатор();
		Элементы.ВариантыОтчета.ТекущаяСтрока = ИдентификаторТекущейСтроки;
		
		ВариантЗагрузкиПериода = ?(Вариант.ВариантЗагрузкиПериода = "", "ВариантСтандартногоПериода.ЭтотМесяц", Вариант.ВариантЗагрузкиПериода);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеДоступаПриИзменении(Элемент)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательскаяНастройкаПриИзменении(Элемент)
	
	УстановитьОграничениеТипа();
	
КонецПроцедуры
